[
  {
    "index": 0,
    "title": "Mushroom Edibility Detector",
    "cardDescription": "This project uses computer vision to classify mushrooms as edible or poisonous based on their features",
    "modalDescription": "Ever wondered which mushrooms are safe to eat? This project uses machine learning to classify mushrooms as edible or poisonous based on their features. We gather publicly available mushroom data on iNaturalist and other sites, explore it to understand common patterns and limitations, and train a model to learn visual cues that separate the two categories. Then, we evaluate how well the model performs, look closely at where it gets confused, and discuss the safety and ethical concerns of using predictions in a real-world context. Using machine learning can help people make informed decisions about which mushrooms are safe to consume.",
    "contributors": [
      "Shant",
      "Andrew"
    ],
    "stack": "Python",
    "status": "Active",
    "link": "https://github.com/shantguedekelian/Mushroom_Edibility_Predictor",
    "img": "/mushroom.jpg"
  },
  {
    "index": 1,
    "title": "NBA Court Geometry Modeling",
    "cardDescription": "This project uses machine learning to look at NBA analytics and player performances",
    "modalDescription": "The game of basketball is evolving. This project investigates how changes to NBA court geometry can be used to counter modern three-point inflation and restore stylistic balance in professional basketball. Using historical NBA shot-tracking and player performance data, the project builds artificial intelligence simulations and machine-learning probability models to estimate shot difficulty and shot selection. By simulating counterfactual court designs—such as extending the three-point arc or widening the baselines—the system evaluates how teams would adapt their offensive strategies under new spatial constraints.",
    "contributors": [
      "Emmanuel",
      "Anthony"
    ],
    "stack": "Python",
    "status": "Active",
    "link": "https://github.com/emjviray/BasketballEngineering",
    "img": "/nba.jpg"
  },
  {
    "index": 2,
    "title": "Machine Learning Interpretability",
    "cardDescription": "This project is focused on Machine Learning Interpretability.",
    "modalDescription": "This project aims to make machine learning models more interpretable and understandable to users. By developing techniques and tools for visualizing and explaining model predictions, we can help users gain insights into how models make decisions and build trust in their outputs.",
    "contributors": [
      "Shreya",
      "Lucas"
    ],
    "stack": "Python",
    "status": "Active",
    "link": "https://github.com/UCSD-AISC/AISC",
    "img": "/machinelearning.avif"
  },
  {
    "index": 3,
    "title": "Data Validation Pipeline",
    "cardDescription": "A service that helps people gather image data through crowdsources contributions; composed of UI, NLP pipeline, and Validation pipeline components.",
    "modalDescription": "This project focuses on building a data validation pipeline to ensure the quality and reliability of image data collected from crowdsourced contributions. The pipeline includes components for user interface design, natural language processing, and data validation to streamline the data collection process.",
    "contributors": [
      "Saarthak Trivedi",
      "Kenzo Ku",
      "Holly Zhu",
      "Arnav Kamdar",
      "Caleb Li"
    ],
    "stack": "Python",
    "status": "Completed",
    "link": "https://github.com/UCSD-AISC/AISC",
    "img": "/colored_logo.png"
  },
  {
    "index": 4,
    "title": "Discord Bot",
    "cardDescription": "A reinforcement learning powered bot to help moderate the spam and inappropriate content in the servers it is placed in.",
    "modalDescription": "This project involves creating a Discord bot that uses reinforcement learning to identify and moderate spam and inappropriate content in real-time. By training the bot on various examples of acceptable and unacceptable content, we can help maintain a positive and safe environment for users.",
    "contributors": [
      "Dario Tzeng",
      "Amogh Manjunath",
      "Sophia Fang",
      "Borna Hematty"
    ],
    "stack": "Python",
    "status": "Completed",
    "link": "https://github.com/UCSD-AISC/AISC",
    "img": "/colored_logo.png"
  },
  {
    "index":5,
    "title": "Website Development",
    "cardDescription": "The development of this website! It was made with NextJS, Typescript, Tailwind, and love.",
    "modalDescription": "This project involves our website development! It was made with NextJS, Typescript, Tailwind, and love. The website serves as a platform to showcase our projects, share updates, and connect with the community. It is designed to be user-friendly and visually appealing, providing an engaging experience for visitors.",
    "contributors": ["Sadrac Santacruz Ibarra", "Rohan Sachdeva"],
    "stack": "Python",
    "status": "Completed",
    "link": "https://github.com/UCSD-AISC/AISC",
    "img": "/colored_logo.png"
  },
  {
    "index":6,
    "title": "Website Development",
    "cardDescription": "The development of this website! It was made with NextJS, Typescript, Tailwind, and love.",
    "modalDescription": "This project involves our website development! It was made with NextJS, Typescript, Tailwind, and love. The website serves as a platform to showcase our projects, share updates, and connect with the community. It is designed to be user-friendly and visually appealing, providing an engaging experience for visitors.",
    "contributors": ["Sadrac Santacruz Ibarra", "Rohan Sachdeva"],
    "stack": "Python",
    "status": "Recruiting",
    "link": "https://github.com/UCSD-AISC/AISC",
    "img": "/colored_logo.png"
  }
]